app/controllers/school_classes_controller.rb

  def create
    @school_class=SchoolClass.create(params[:school_class].permit(:title,:room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-04-09 09:43:33.101144"], ["updated_at", "2019-04-09 09:43:33.101144"]]

  def update
    @school_class=SchoolClass.find(params[:id])
    @school_class.update(params[:school_class].permit(:title,:room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-04-09 09:43:33.428225"], ["id", 1]]